marcolo-30/Proyecto2_RTOS/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S2_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S2_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S2_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S2_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S2_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC16 (number 90), J2[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S1_FGPIO FGPIOC              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S1_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S1_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S1_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S1_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S1_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTA7 (number 41), J2[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_E_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_E_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_E_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_E_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_E_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_E_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTE30 (number 27), J4[11]/DAC_OUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D7_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D7_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D7_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D7_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D7_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D7_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTB20 (number 66), J4[9]/CMP_OUT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D6_FGPIO FGPIOB              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D6_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D6_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D6_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D6_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D6_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE23 (number 21), J4[7]/DIFF_ADC1_DM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D5_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D5_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D5_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D5_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D5_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D5_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTE21 (number 19), J4[3]/DIFF_ADC0_DM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_D4_FGPIO FGPIOE              /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_D4_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_D4_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_D4_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_D4_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_D4_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                    /* @} */

/*! @name PORTC0 (number 70), J1[5]/I2S_TXD
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S8_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S8_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S8_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S8_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S8_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S8_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC4 (number 80), J1[7]/I2S_MCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_S7_FGPIO FGPIOC             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_S7_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_S7_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_S7_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_S7_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_S7_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                   /* @} */

/*! @name PORTC6 (number 82), J1[9]/I2S_RX_BCLK
  @{ */

